results/cpu-vs-latency5/memcached/7-1/nsl205.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2329962 ops,   88222 (avg:   77662) ops/sec, 3.33MB/sec (avg: 2.93MB/sec),  1.27 (avg:  1.44) msec latency

7         Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        7061.52          ---          ---      1.45400       523.44
Gets       70600.81      9927.61     60673.21      1.43700      2475.63
Totals     77662.33      9927.61     60673.21      1.43800      2999.06


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     81.51416
SET       2.000     94.39614
SET       3.000     94.44995
SET       4.000     94.49055
SET       5.000     98.92709
SET       6.000     99.63418
SET       7.000     99.64173
SET      11.000     99.64976
SET      12.000     99.66864
SET      13.000     99.73567
SET      14.000     99.84990
SET      15.000     99.93061
SET      16.000     99.98442
SET      17.000     99.99622
SET      18.000     99.99953
SET      21.000    100.00000
---
GET       0.150      0.00005
GET       0.160      0.00009
GET       0.180      0.00024
GET       0.190      0.00042
GET       0.200      0.00090
GET       0.210      0.00123
GET       0.220      0.00142
GET       0.230      0.00184
GET       0.240      0.00217
GET       0.250      0.00269
GET       0.260      0.00307
GET       0.270      0.00345
GET       0.280      0.00420
GET       0.290      0.00496
GET       0.300      0.00581
GET       0.310      0.00628
GET       0.320      0.00760
GET       0.330      0.00840
GET       0.340      0.00982
GET       0.350      0.01171
GET       0.360      0.01350
GET       0.370      0.01492
GET       0.380      0.01766
GET       0.390      0.02096
GET       0.400      0.02417
GET       0.410      0.02724
GET       0.420      0.02989
GET       0.430      0.03361
GET       0.440      0.04013
GET       0.450      0.04462
GET       0.460      0.04905
GET       0.470      0.05354
GET       0.480      0.05850
GET       0.490      0.06383
GET       0.500      0.06765
GET       0.510      0.07105
GET       0.520      0.07384
GET       0.530      0.07762
GET       0.540      0.08031
GET       0.550      0.08408
GET       0.560      0.08786
GET       0.570      0.09192
GET       0.580      0.09598
GET       0.590      0.09966
GET       0.600      0.10368
GET       0.610      0.10845
GET       0.620      0.11293
GET       0.630      0.11779
GET       0.640      0.12431
GET       0.650      0.13243
GET       0.660      0.14107
GET       0.670      0.15169
GET       0.680      0.16156
GET       0.690      0.17407
GET       0.700      0.18875
GET       0.710      0.20542
GET       0.720      0.22676
GET       0.730      0.25273
GET       0.740      0.28587
GET       0.750      0.32184
GET       0.760      0.36873
GET       0.770      0.42547
GET       0.780      0.49790
GET       0.790      0.57863
GET       0.800      0.67216
GET       0.810      0.78178
GET       0.820      0.91827
GET       0.830      1.11892
GET       0.840      1.45030
GET       0.850      2.03720
GET       0.860      3.07123
GET       0.870      4.85683
GET       0.880      7.75414
GET       0.890     12.15807
GET       0.900     18.45468
GET       0.910     26.61229
GET       0.920     35.97569
GET       0.930     45.46600
GET       0.940     53.97501
GET       0.950     60.87400
GET       0.960     66.02373
GET       0.970     69.63177
GET       0.980     72.07631
GET       0.990     73.71338
GET       1.000     77.14739
GET       1.100     78.69797
GET       1.200     78.87742
GET       1.300     78.90367
GET       1.400     78.91330
GET       1.500     78.92530
GET       1.600     78.94508
GET       1.700     78.97104
GET       1.800     79.82279
GET       1.900     80.93379
GET       2.000     81.08779
GET       2.100     81.17268
GET       2.200     82.01820
GET       2.300     86.71857
GET       2.400     92.39855
GET       2.500     94.12249
GET       2.600     94.37210
GET       2.700     94.40345
GET       2.800     94.40930
GET       2.900     94.41091
GET       3.000     94.41185
GET       3.100     94.41417
GET       3.200     94.41889
GET       3.300     94.42248
GET       3.400     94.42724
GET       3.500     94.43234
GET       3.600     94.43758
GET       3.700     94.44363
GET       3.800     94.44858
GET       3.900     94.45184
GET       4.000     94.45453
GET       4.100     94.45755
GET       4.200     94.46067
GET       4.300     94.46298
GET       4.400     94.46577
GET       4.500     94.46978
GET       4.600     94.47337
GET       4.700     94.47781
GET       4.800     94.48305
GET       4.900     94.48970
GET       5.000     94.50467
GET       5.100     94.54390
GET       5.200     94.64782
GET       5.300     94.89941
GET       5.400     95.36520
GET       5.500     96.12244
GET       5.600     97.06601
GET       5.700     97.95676
GET       5.800     98.69218
GET       5.900     99.18682
GET       6.000     99.44951
GET       6.100     99.56452
GET       6.200     99.60857
GET       6.300     99.62235
GET       6.400     99.62566
GET       6.500     99.62773
GET       6.600     99.63123
GET       6.700     99.63477
GET       6.800     99.63633
GET       6.900     99.63685
GET       7.000     99.63755
GET       7.100     99.63798
GET       7.200     99.63812
GET       7.300     99.63821
GET       7.400     99.63845
GET       7.500     99.63873
GET       7.600     99.63916
GET       7.700     99.63921
GET       7.800     99.63944
GET       7.900     99.63977
GET       8.000     99.63991
GET       8.200     99.64010
GET       8.300     99.64039
GET       8.600     99.64048
GET       8.700     99.64053
GET       9.100     99.64058
GET       9.200     99.64067
GET       9.300     99.64076
GET       9.400     99.64091
GET       9.500     99.64133
GET       9.600     99.64152
GET       9.700     99.64180
GET       9.800     99.64204
GET       9.900     99.64232
GET      10.000     99.64610
GET      11.000     99.64747
GET      12.000     99.65228
GET      13.000     99.70828
GET      14.000     99.82418
GET      15.000     99.92781
GET      16.000     99.98518
GET      17.000     99.99703
GET      18.000     99.99891
GET      19.000    100.00000